{
    "version": "https://jsonfeed.org/version/1",
    "title": "Csharp and Game Development Notes",
    "description": "",
    "home_page_url": "https://pilvimaa.fi",
    "feed_url": "https://pilvimaa.fi/feed.json",
    "user_comment": "",
    "icon": "https://pilvimaa.fi/media/website/Hedgehog.png",
    "author": {
        "name": "Pilvinen"
    },
    "items": [
        {
            "id": "https://pilvimaa.fi/how-to-setup-sqlite-database-with-ef-core-and-godot/",
            "url": "https://pilvimaa.fi/how-to-setup-sqlite-database-with-ef-core-and-godot/",
            "title": "How to setup SQLite database with EF Core and Godot",
            "summary": "EF Core is a popular high level object relational mapper (ORM) which can have various databases at the backend. As a database noobie, I recently had a bit of a&hellip;",
            "content_html": "<p>EF Core is a popular high level object relational mapper (ORM) which can have various databases at the backend.</p>\n<p>As a database noobie, I recently had a bit of a trouble setting it up with Godot and SQLite. There was very little practical information available from a beginner’s perspective for setting it up successfully with Godot.</p>\n<p>I hit a dead end several times trying to follow the official MS docs and bunch of tutorials, but eventually with a help from a friend got it working.</p>\n<p>So I thought I might as well write a quick article about it - from my own unique database noob perspective. In case someone else is having the same challenges.</p>\n<p>If you’re looking for educated, accurate, precise and scientific description of how this piece of… technology… works, avert your eyes and never return!</p>\n<p>At the time of writing this, Godot 4.2.2 has been out for a while and Godot 4.3 hasn’t yet been released. I’m running on .NET 8 and using C# 12. These instructions have been written for that in mind and specifically for Rider IDE. If you’re dealing with another IDE or the command line, you will have to figure those parts out for yourself.</p>\n<h1 id=\"setting-up-a-class-library\">Setting up a class library</h1>\n<p>Since we’re going to use the Migrations feature of EF Core, to get things working  properly with Godot’s SDK, you’re going to need to create your database as a separate project, as a <strong>class library</strong>.</p>\n<p>To do that, right click your solution in Rider’s solution explorer and select <strong>Add &gt; New Project</strong> and make it a <strong>Class Library</strong>. It will be created directly under your main project for easy access. You can call it “Database”, or what ever you like.</p>\n<h1 id=\"linking\">Linking</h1>\n<p>To be able to do anything with the Database project it needs to be linked with your main project. So right click in Rider’s solution explorer your main project and select <strong>Add &gt; Reference</strong>, select the box for Database and click the <strong>Add</strong> button. Done.</p>\n<h1 id=\"dealing-with-assemblyinfo-duplicate-attributes\">Dealing with AssemblyInfo duplicate attributes</h1>\n<p>You might have noticed that there’s now a funny new folder in your main project, which is from the Database project. You might be tempted to exclude it, and if you do, you’re on your own dealing with potential issues that might arise from that.</p>\n<p>In this tutorial we’re going to edit the your main project’s <code>.csproj</code> file and add inside the <code>&lt;PropertyGroup&gt;&lt;/PropertyGroup&gt;</code> tags near the top the following mystical tags:</p>\n<pre><code class=\"language-xml\">&lt;GenerateAssemblyInfo&gt;false&lt;/GenerateAssemblyInfo&gt;\n</code></pre>\n<p>And its good buddy:</p>\n<pre><code class=\"language-xml\">&lt;GenerateTargetFrameworkAttribute&gt;false&lt;/GenerateTargetFrameworkAttribute&gt;\n</code></pre>\n<p>And by doing this magical ritual you will get rid of <strong>compilation errors</strong> caused by not excluding the aforementioned folders from your Database project - by doing which you will avoid <em>another set of problems</em>.</p>\n<p>Just do it. You can change your setup later on your own if you’re not happy with it. Let’s first get things working.</p>\n<h1 id=\"dealing-with-nuget\">Dealing with NuGet</h1>\n<p>The three packages you need to install from NuGet are:</p>\n<p><code>Microsoft.EntityFrameworkCore.Sqlite</code>\n<code>Microsoft.EntityFrameworkCore.Design</code>\n<code>Microsoft.EntityFrameworkCore.Tools</code></p>\n<p>You will need to add these to your <strong>Database</strong> project. You will likely not need them in your main project.</p>\n<h1 id=\"lets-add-some-classes\">Let’s add some classes</h1>\n<p>We’re going to need some code to be able to do anything with the database.</p>\n<h3 id=\"savegamemanifestcs\">SaveGameManifest.cs</h3>\n<p>You can arrange your projects how ever you like, but I recommend you create in the <strong>Database</strong> project a folder named <code>DatabaseSets</code>. This folder will hold your C# classes which essentially represent your database tables.</p>\n<p>For fun let’s add <code>SaveGameManifest.cs</code> file in that folder which will represent the data in your table. It’s basically a schema or “entity”. It’s the stuff you want to store in the database.</p>\n<pre><code class=\"language-cs\">using System.ComponentModel.DataAnnotations;\nusing System.ComponentModel.DataAnnotations.Schema;\nusing Microsoft.EntityFrameworkCore;\n\nnamespace Database;\n\n[Table(&quot;SaveGameManifest&quot;)] // Name of the table in the database for this class.\n[PrimaryKey(nameof(DatabaseId))] // They key you can directly fetch the data with.\npublic sealed class SaveGameManifest {\n\n    // The primary Guid based key to access this save game manifest.\n    [Column(nameof(DatabaseId))] // The database column name.\n    public Guid DatabaseId { get; set; } \n\n    // The name of the save game as inputted by user.\n    [Column(nameof(SaveName)), MaxLength(128),] // EF Core doesn&#39;t like strings of unrestricted length.\n    public string SaveName { get; set; } = string.Empty;\n\n    // The date when the save game was last saved.\n    [Column(nameof(LastSaved))]\n    public DateTime LastSaved { get; set; } = DateTime.Now;\n\n    // Required for database. Do not remove.\n    public SaveGameManifest() {}\n\n    public SaveGameManifest(Guid databaseId, string saveName) {\n        DatabaseId = databaseId;\n        SaveName = saveName;\n    }\n}\n</code></pre>\n<p>And that’s it. We decorated our class and properties with attributes which instruct EF Core what everything is, ie. how it should be saved in the database. SQLite database is basically just a fancy a big Excel sheet. <strong>Tables</strong> tell you what type of stuff is in there in general (they are kind like file system folders), and <strong>Columns</strong> tell you what should go in here, and <strong>rows</strong> of the columns contain the actual data, data, data and more data.</p>\n<h3 id=\"databaseconnectioncs\">DatabaseConnection.cs</h3>\n<p>I like to name the <code>DbContext</code> class <code>DatabaseConnection</code>, it makes it easier for me to comprehend what is going on.</p>\n<p>There are lots of ways you could set up this file, so don’t be mistaken that this is the only way or even necessarily a good way. This is the database noob way that I came up with, the way which made sense to me personally.</p>\n<p>This class essentially represents your database / gives you access to everything.</p>\n<p>So in my setup you would call <code>DatabaseConnection.Instance.SaveGameManifests</code>, for example, to gain access to the <code>SaveGameManifest</code> tables via the <code>DbSet</code>. And you might call <code>DatabaseConnection.Instance.SaveChanges()</code> to save the database after making changes, etc.</p>\n<pre><code class=\"language-cs\">using Database;\nusing Microsoft.EntityFrameworkCore;\n\nnamespace YourMainProjectNameSpace;\n\n// We need to inherit DbContext. This allows us to connect to the database.\npublic sealed class DatabaseConnection : DbContext {\n\n    // I set this up as a singleton. But you can do what ever you like.\n    private static DatabaseConnection _instance;\n\n    /*\n        To be able to pass the user folder path to our database (where our database\n        is saved) I created a Configure method which must be called before using\n        the database for the first time. This is all about that.\n        */\n    private static bool _isConfigured = false;\n\n    public static void Configure(string userFolder) {\n        if (_instance == null) {\n            _instance = new DatabaseConnection(userFolder);\n            _isConfigured = true;\n        }\n    }\n\n    public static DatabaseConnection Instance {\n        get {\n            if (!_isConfigured) throw new InvalidOperationException(&quot;DatabaseHandler is not configured. Call Configure() before accessing Instance.&quot;);\n            return _instance;\n        }\n    }\n\n    // These are used in setting up the paths.\n    private string _userFolder;\n    private string _databaseFolder = &quot;database&quot;;\n    private string _databasePath = &quot;database.db&quot;;\n    private string _fullDatabaseFilePath;\n\n    /*\n        DbSets contain essentially the tables of the database.\n        You should probably have all your tables defined here in this class,\n        Instead of trying to spread them around or anything like that. I hear it&#39;s\n        a common practice, so it should be good enough for you too.\n        So below here, in production code, would be a big list of DbSet&lt;T&gt;s.\n        */ \n    public DbSet&lt;SaveGameManifest&gt; SaveGameManifests { get; set; }\n\n    // Again, empty constructor is needed or everything fails to work.\n    public DatabaseConnection() {}\n\n    /*\n        And here is the constructor that we use to build things up.\n        Notice that we take in the user:// folder path here. But if you prefer\n        an alternate method, do what ever you like.\n        */\n    public DatabaseConnection(string userFolder) {\n        _userFolder = userFolder;\n\n        // Console.WriteLine(&quot;Initializing DatabaseHandler.&quot;);\n\n        // Generate the file paths.\n        GeneratePaths();\n\n        // Console.WriteLine(&quot;Database file paths generated.&quot;);\n\n        // Attempt to create the database file if it doesn&#39;t exist yet.\n        TryCreateDatabaseFile(_fullDatabaseFilePath);\n    }\n\n    /*\n        This bit of code is needed to configure that we&#39;re using SQLite and set the path.\n        Feel free to throw in more config options if you need them.\n        */\n    protected override void OnConfiguring(DbContextOptionsBuilder optionsBuilder) {\n        optionsBuilder.UseSqlite($&quot;Data Source={_fullDatabaseFilePath}&quot;);\n    }\n\n\n    private void GeneratePaths() {\n\n        //Console.WriteLine(&quot;Generating database file paths.&quot;);\n\n        // Get the full path to the database file.\n        _fullDatabaseFilePath = Path.Combine(_userFolder, _databaseFolder, _databasePath);\n    }\n\n    /// &lt;summary&gt;\n    /// If the database file does not exist, create it.\n    /// &lt;/summary&gt;\n    private static void TryCreateDatabaseFile(string fullDatabaseFilePath) {\n\n        //Console.WriteLine(&quot;Trying to create the database file.&quot;);\n\n        // If the database exists already, we don&#39;t need to create it.\n        bool databaseExists = File.Exists(fullDatabaseFilePath);\n        if (databaseExists) return;\n\n        //Console.WriteLine(&quot;Database does not exist. Trying to create a new SQLite database file.&quot;);\n\n        // Try to create the database folder first and then the database file.\n        try {\n            string fullFolderPath = Path.GetDirectoryName(fullDatabaseFilePath);\n            Directory.CreateDirectory(fullFolderPath ?? throw new InvalidOperationException());\n            File.Create(fullDatabaseFilePath).Close();\n        } catch (Exception e) {\n            Console.WriteLine(e);\n            throw;\n        }\n\n        // Check if the database file exists. It should.\n        if (!File.Exists(fullDatabaseFilePath)) {\n            throw new Exception(&quot;Failed to create the database file.&quot;);\n        }\n\n        //Console.WriteLine(&quot;SQLite database file created successfully.&quot;);\n    }\n}\n</code></pre>\n<h3 id=\"maincs\">Main.cs</h3>\n<p>In our test this file resides in your main project - or where ever, but what I’m trying to say, it’s <em><strong>not</strong></em> in the <strong>Database</strong> project in this example.</p>\n<p>The <code>Main.cs</code> represents some kind of controller or other class which does something practical with the database.</p>\n<p>For our purposes we simply want to output something to see that everything works.</p>\n<pre><code class=\"language-cs\">\nusing Database;\nusing Godot;\nusing Microsoft.EntityFrameworkCore;\nusing YourMainProjectNamespace.Database; // (Unless you excluded the database folder)\n\nnamespace YourMainProjectNamespace;\n\n// Oh yes, we&#39;re likely in Godot now doing something fun with the database.\npublic partial class Main : Node3D {\n\n    /*\n        In this example we store a reference to the connection, but normally you might\n        just use a using block for the duration of the database operation you want\n        to perform. You can do it both ways depending on the requirements.\n        */\n    private DatabaseConnection _databaseConnection;\n\n    public override async void _Ready() {\n\n        /*\n                Configure the database connection. We need to run configure\n                and pass the user data directory from Godot to the database\n                class library before we can access the instance.\n                (Simply because we happened to code it that way in this example.\n                You do what you like. It doesn&#39;t matter.)\n                */\n        DatabaseConnection.Configure(OS.GetUserDataDir());\n        _databaseConnection = DatabaseConnection.Instance;\n\n        try {\n            // Run migrate to create/update the database and tables if they don&#39;t exist/aren&#39;t up-to-date.\n            await _databaseConnection.Database.MigrateAsync();\n                        \n                        // Now we can use the database after we&#39;ve run Migrate. Not before.\n\n            // Add test data to the database so we have something to show.\n            await AddTestDataEntriesAsync();\n\n              // Do something for fun.\n            await RunDatabaseTests();\n\n        } catch (Exception e) {\n            GD.PrintErr(e);\n            throw;\n        }\n    }\n\n    /// &lt;summary&gt;\n    /// Add test data to the database.\n    /// &lt;/summary&gt;\n    private async Task AddTestDataEntriesAsync() {\n\n        // Instantiate test data.\n        SaveGameManifest saveGameManifest = new (Guid.NewGuid(), &quot;Test Save Game&quot;);\n\n        // Add test data to database.\n        await DatabaseConnection.Instance.AddAsync(saveGameManifest);\n\n        // Save changes to database to disc.\n        await DatabaseConnection.Instance.SaveChangesAsync();\n    }\n\n    /// &lt;summary&gt;\n    /// Run database tests to see if it&#39;s working.\n    /// &lt;/summary&gt;\n    private async Task RunDatabaseTests() {\n\n        // Get data from database and output it.\n        Console.WriteLine(&quot;Fetching SaveGameManifests from database...&quot;);\n\n        // Fetch all SaveGameManifest entries from the database table.\n        DbSet&lt;SaveGameManifest&gt; results = DatabaseConnection.Instance.SaveGameManifests;\n\n        // Output the results.\n\n        Console.WriteLine(&quot;Results:&quot;);\n\n        await foreach (SaveGameManifest manifest in results.AsAsyncEnumerable()) {\n            Console.WriteLine($&quot;DatabaseId: {manifest.DatabaseId}, SaveName: {manifest.SaveName}, LastSaved: {manifest.LastSaved}&quot;);\n        }\n\n        Console.WriteLine($&quot;Results count: {results.Count()}&quot;);\n    }\n}\n</code></pre>\n<h1 id=\"database-tab\">Database tab</h1>\n<p>At this point you might like to, or need to, connect the database in the database tab in Rider. Among other things this will allow you to inspect the contents of the SQLite database, which can be very helpful in debugging.</p>\n<h1 id=\"migrations\">Migrations</h1>\n<p>Now that we’re done with all of that, create a <code>Migrations</code> folder in the <strong>Database</strong> project.</p>\n<p>Right click on the <code>Database</code> project in the Solution Explorer and there should be entry for <strong>Entity Framework Core</strong> near the top of the context menu that pops open.</p>\n<p>Click <strong>Add Migration</strong>.</p>\n<p>The name can be anything you like which helps you understand what the migration is.</p>\n<p>Migration project and Startup project should be <code>Database</code>.</p>\n<p>DbContext class should be <code>DatabaseConnection</code>.</p>\n<p>The <code>Migrations</code> folder has to point to the <code>Migrations</code> folder you created.</p>\n<p><code>Target Framework</code> should probably be set to the .NET version you’re using.</p>\n<p>Everything else can be at defaults. Hit OK.</p>\n<p>If all goes well you should see <code>DatabaseConnectionModelSnapshot.cs</code> file being generated and also a file called something like <code>20240702182449_Initial.Designer.cs</code>.</p>\n<p>You should now have a fully functional setup ready for running.</p>\n<h1 id=\"how-to-use-migrations\">How to use migrations?</h1>\n<p>Every time you’ve changed the schema, ie. your tables, columns, added new types, removed columns, tables, changed types, changed names, etc. In other words every time your data definitions change and your database types don’t anymore reflect your types in code, you should run <code>Entity Framework Core &gt; Add Migration</code>.</p>\n<p>This will update the migration path of your data and tell your database how it should update and change between different versions.</p>\n<h1 id=\"problems\">Problems</h1>\n<p>The database will be created in Godot’s <code>user://</code> folder. If you have trouble finding it you can open Godot and go to <code>Editor &gt; Open Editor Data Folder</code> and look it up from there.</p>\n<p>You can always just delete the database file and delete the Migrations files when testing things. Don’t do that in production when you’ve released something. You should only add new migrations then, and never remove them, if they have already been released out to the wild.</p>\n<p>Unless I forgot something or you’ve got a different kind of setup, these instructions should more or less work. I did not, however, specifically go out of my way to test these instructions step by step to insure that they work on a clean system. I wrote the instructions from memory. So there may be factual errors. If that’s the case, you can contact me on Star and Serpent’s Discord. The link is on Star and Serpent’s home page.</p>\n",
            "image": "https://pilvimaa.fi/media/posts/19/Database.png",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "tutorial",
                   "sqlite",
                   "ef core",
                   "database",
                   "Godot",
                   "Csharp"
            ],
            "date_published": "2024-07-03T01:24:09+03:00",
            "date_modified": "2024-07-03T01:24:09+03:00"
        },
        {
            "id": "https://pilvimaa.fi/bullet-parenting-trick/",
            "url": "https://pilvimaa.fi/bullet-parenting-trick/",
            "title": "Bullet parenting trick",
            "summary": "In Godot if you have a bullet parented to your player, obviously the bullets will move when the player moves. So you need a node outside of your player hierarchy&hellip;",
            "content_html": "<p>In Godot if you have a bullet parented to your player, obviously the bullets will move when the player moves.</p>\n<p>So you need a node outside of your player hierarchy to parent them to, eg. something like:</p>\n<pre><code>- World\n    - Bullets \n    - Player\n    - EnemyA\n    - EnemyB\n</code></pre>\n<p>This works fine, but can make controlling the bullets a chore due to required boiler plate code.</p>\n<p>But… what if you don’t need to do that?</p>\n<p>If you put a node of type <code>Node</code> inside your Player scene it will break the inheritance hierarchy because Node is such a simple type.</p>\n<p>In that case you can have:</p>\n<pre><code>- Player (Node2D)\n  - Bullets (Node)\n    - Bullet (Node2D)\n    - Bullet (Node2D)\n    - Bullet (Node2D)\n    - Bullet (Node2D)\n</code></pre>\n<p>And with this the movement of <code>Player</code> won’t affect position of <code>Bullets</code> because the inheritance hierarchy doesn’t work between them.</p>\n",
            "image": "https://pilvimaa.fi/media/posts/18/bullet_hell.png",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "Inheritance",
                   "Godot"
            ],
            "date_published": "2024-02-09T11:06:05+02:00",
            "date_modified": "2024-02-09T11:06:05+02:00"
        },
        {
            "id": "https://pilvimaa.fi/what-to-return-when-you-dont-have-anything-to-return/",
            "url": "https://pilvimaa.fi/what-to-return-when-you-dont-have-anything-to-return/",
            "title": "What to return when you don&#x27;t have anything to return?",
            "summary": "Not finding your data that you are trying to fetch via Guid Id can be handled elegantly either as a case of domain error or just as a regular case&hellip;",
            "content_html": "<p>Not finding your data that you are trying to fetch via <code>Guid</code> <strong>Id</strong> can be handled elegantly either as a case of <strong>domain error</strong> or just as a <strong>regular case</strong> that you’re expecting to happen. We will only go in-depth with domain error in this article and do a quick overview on regular cases.</p>\n<h2 id=\"domain-error\">Domain error</h2>\n<p>When fetching data we can handle domain errors with our own custom <code>Result</code> type which also includes an <strong>error</strong>.</p>\n<p>But what is a “domain error”?</p>\n<p>In software development, a “domain error” happens when there’s a mistake or issue because the rules or limitations of a particular area, or situation, that the software is designed for are not followed properly. For example, if the software is made to handle banking transactions but does something against banking rules, that’s a domain error.</p>\n<p>If you’re working with a system where each entity is uniquely identified by a GUID (Globally Unique Identifier), not finding an entity by its GUID could indicate a more serious issue. This might be because the data doesn’t exist, it’s not accessible for some reason, or there’s an inconsistency in the data integrity.</p>\n<p>In such scenarios, using a <code>Result</code> type that includes an <strong>error</strong> is beneficial. The Result type, commonly found in functional programming - and increasingly in other paradigms - is a way to encapsulate either a successful outcome (with the expected data) or an error (with details about what went wrong). This approach is more informative than simply returning <code>null</code> or an <strong>optional</strong> object because it provides explicit information about the nature of the error, which is critical for debugging and handling exceptional cases properly.</p>\n<p>Handling a returned <code>Result</code> type without resorting to branching logic (like if or switch statements) often involves leveraging higher-order functions or patterns such as monadic binding. In C#, this can be achieved through extension methods that abstract away the branching logic. It’s still there, but hidden away for the most part. You don’t get the branching logic vomited all over your classes which should be focused on other things.</p>\n<p>Let’s consider a hypothetical <code>Result&lt;T, E&gt;</code> type, where <code>T</code> is the type of the value in case of success, and <code>E</code> is the type of the error. We will define extension methods like <code>OnSuccess</code> and <code>OnError</code> to handle each case.</p>\n<p>Here’s an example implementation:</p>\n<pre><code class=\"language-csharp\">public class Result&lt;T, E&gt; {  \n    public T Value { get; private set; }  \n    public E Error { get; private set; }  \n    public bool HasValue { get; private set; }  \n  \n    // Constructors  \n    public Result(T value) {  \n        Error = default!; // Replace with what you want to do here\n        Value = value;  \n        HasValue = true;  \n    }  \n  \n    public Result(E error) {  \n        Error = error;  \n        Value = default!; // Replace with what you want to do here \n        HasValue = false;  \n    }  \n}\n\npublic static class ResultExtensions {  \n  \n    // Extension method for success case.  \n    public static Result&lt;T, E&gt; OnSuccess&lt;T, E&gt;(this Result&lt;T, E&gt; result, Action&lt;T&gt; action) {  \n        if (result.HasValue) {  \n            action(result.Value);  \n        }  \n        return result;  \n    }  \n  \n    // Extension method for error case.  \n    public static void OnError&lt;T, E&gt;(this Result&lt;T, E&gt; result, Action&lt;E&gt; action) {  \n        bool errorHasOccurredHasNoValue = !result.HasValue;  \n        if (errorHasOccurredHasNoValue) {  \n            action(result.Error);  \n        }  \n    }  \n  \n}  \n\npublic sealed class ResultTypeTest {  \n  \n    private readonly Guid _correctId = Guid.NewGuid();  \n    private readonly Guid _wrongId = Guid.NewGuid();  \n  \n    private readonly Database _database;  \n  \n    public ResultTypeTest() {  \n        _database = new (_correctId);  \n    }  \n  \n    public void Test() {  \n  \n        // Database has been set up with data that we should be able to fetch with _correctId,  \n        // whereas _wrongId should return an error because data by that id does not exist.        Result&lt;SomeData, DomainError&gt; correctResult = GetData(_correctId);  \n        Result&lt;SomeData, DomainError&gt; wrongResult = GetData(_wrongId);  \n  \n        correctResult.OnSuccess(data =&gt; {  \n            // Do something with data  \n            Console.WriteLine($&quot;DEBUG: correctResult: Data fetched successfully, data.Id: {data.Id}&quot;);  \n        }).OnError(error =&gt; {  \n            // Do something with error  \n            Console.WriteLine($&quot;DEBUG: correctResult: Error fetching data, error message: {error.Message}&quot;);  \n        });  \n  \n        wrongResult.OnSuccess(data =&gt; {  \n            // Do something with data  \n            Console.WriteLine($&quot;DEBUG: wrongResult: Data fetched successfully, data.Id: {data.Id}&quot;);  \n        }).OnError(error =&gt; {  \n            // Print error  \n            Console.WriteLine($&quot;DEBUG: wrongResult: Error fetching data, error message: {error.Message}&quot;);  \n        });  \n  \n    }  \n  \n    private Result&lt;SomeData, DomainError&gt; GetData(Guid id) {  \n        bool dataExists = _database.CheckDataExists(id);  \n  \n        if (dataExists) {  \n            return new Result&lt;SomeData, DomainError&gt;(_database.data);  \n        }  \n  \n        return new Result&lt;SomeData, DomainError&gt;(new DomainError(&quot;Domain error: Data not found.&quot;));  \n    }  \n  \n}  \n  \n  \npublic class Database {  \n    public SomeData data { get; set; }  \n    public Database(Guid id) {  \n        data = new SomeData(id);  \n    }  \n  \n    public bool CheckDataExists(Guid id) {  \n        return id == data.Id;  \n    }  \n}  \n  \npublic class SomeData {  \n    public Guid Id { get; }  \n    public SomeData(Guid id) {  \n        Id = id;  \n    }  \n}  \n\npublic class DomainError {  \n    public string Message { get; }  \n    public DomainError(string message) {  \n        Message = message;  \n    }  \n}\n</code></pre>\n<p>In this example, <code>GetData</code> returns a <code>Result&lt;SomeData, DomainError&gt;</code>. Depending on whether <code>GetData</code> succeeds or fails, either <code>HandleData</code> or <code>LogError</code> will be executed. The key here is that the <code>OnSuccess</code> and <code>OnError</code> methods encapsulate the branching logic, allowing for a more fluent and declarative style of programming.</p>\n<p>The <code>data =&gt; HandleData(data)</code> is a lambda expression that represents an <code>Action&lt;T&gt;</code>. It’s a method taking <code>data</code> as a parameter and then calling <code>HandleData</code> with it. Similarly, <code>error =&gt; LogError(error)</code> is an <code>Action&lt;E&gt;</code>, handling the error case.</p>\n<p>This approach is quite powerful as it separates the concerns of error handling from the main business logic, leading to cleaner and more maintainable code. You can further refine this pattern by adding more methods for chaining, like Map for transforming the result, Bind for monadic operations, etc. This makes the Result type a very flexible tool for robust error handling without resorting to traditional branching logic.</p>\n<p>The provided code snippet demonstrated several programming techniques and concepts:</p>\n<ol>\n<li><p><strong>Encapsulation and Monadic Design Pattern</strong>: The <code>Result&lt;T, E&gt;</code> class demonstrates encapsulation by containing both success and error states along with their values. This approach, akin to a monadic design pattern, organizes state handling within a structured object, avoiding dispersed code management. While not a full monad, <code>Result</code> mimics monadic aspects by providing methods to process values or errors without manual state checks.</p>\n</li>\n<li><p><strong>Fluent Interface and Method Chaining</strong>: The <code>Result</code> class employs a fluent interface through method chaining. The methods <code>OnSuccess</code> and <code>OnError</code> return the <code>Result</code> object itself, allowing for chaining multiple methods in a single statement. This design enhances code readability and conciseness, characteristic of fluent interfaces.</p>\n</li>\n<li><p><strong>Delegation and Higher-Order Functions</strong>: <code>OnSuccess</code> and <code>OnError</code> serve as higher-order functions, taking <code>Action&lt;T&gt;</code> and <code>Action&lt;E&gt;</code> delegates as parameters. They exemplify delegation by passing execution based on the <code>Result</code> object’s state to these provided action functions. This pattern allows for flexible and dynamic handling of different execution scenarios.</p>\n</li>\n<li><p><strong>Lambda Expressions and Conditional Execution</strong>: Lambda expressions like <code>data =&gt; HandleData(data)</code> and <code>error =&gt; LogError(error)</code> in C# provide concise representations of anonymous methods. The implementation of <code>OnSuccess</code> and <code>OnError</code> involves conditional execution, determining action invocation based on the <code>Result</code> object’s success state, often utilizing these lambda expressions for inline logic definition.</p>\n</li>\n</ol>\n<h2 id=\"regular-case\">Regular case</h2>\n<p>Default value such as Optional object can help to recover from not finding the Guid Id.</p>\n<p>If the absence of data corresponding to a GUID is a regular occurrence and not indicative of a deeper issue, then using an optional object like <code>Option&lt;T&gt;</code> is a more appropriate approach. <code>Option&lt;T&gt;</code> is a container that either holds a value of type <code>T</code> (representing the presence of data) or is empty (representing the absence of data).</p>\n<p>This approach is particularly useful in cases where the absence of data is a normal - an expected part of the application’s flow. For example if a user is searching for a record that doesn’t exist, it isn’t necessarily an error. It could also mean that the record hasn’t been created yet. By using <code>Option&lt;T&gt;</code>, you can handle these scenarios without resorting to <code>null</code> checks or throwing exceptions. It allows the calling code to handle the case of missing data, perhaps by taking alternative actions or providing a default value.</p>\n<p>I won’t go into details about this. But <code>Option&lt;T&gt;</code> is available, for example, from the popular function library <code>LanguageExt</code>.</p>\n",
            "image": "https://pilvimaa.fi/media/posts/17/nothing_to_return-2.png",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
            ],
            "date_published": "2023-11-23T18:33:04+02:00",
            "date_modified": "2023-11-23T20:10:24+02:00"
        },
        {
            "id": "https://pilvimaa.fi/godot-control-node-mouse-input-handling-order/",
            "url": "https://pilvimaa.fi/godot-control-node-mouse-input-handling-order/",
            "title": "Godot Control node mouse input handling order",
            "summary": "Godot mouse input handling is a source of lot of confusion. The basic idea is that Mouse Filter set to Ignore ignores the element. Stop processes the received event and&hellip;",
            "content_html": "<p>Godot mouse input handling is a source of lot of confusion.</p>\n<p>The basic idea is that <strong>Mouse Filter</strong> set to <code>Ignore</code> ignores the element. <code>Stop</code> processes the received event and doesn’t pass it along. It stops there. While <code>Pass</code> handles the event but then passes it along so other nodes can process it.</p>\n<p>Where most of the confusion happens is trying to figure out in what order the mouse input events get processed.</p>\n<p>Godot handles the input in nodes in reverse depth-first order.</p>\n<p>In other words the order is:</p>\n<ol>\n<li>Bottom to top (ie. reverse)</li>\n<li>Children first (ie. depth).</li>\n</ol>\n<h1 id=\"tree-order-example\">Tree order example</h1>\n<pre><code>- Last\n    - Sixth\n        - Fifth\n    - Fourth\n        - Third\n            - Second\n            - First\n</code></pre>\n<p>One of the more important things to understand is that <em><strong>sibling nodes DO NOT react to Mouse Filter being set to <code>Pass</code>!!!</strong></em></p>\n<p>When a node is <code>Pass</code>ing event forward it <strong>ONLY</strong> passes it to its direct parent.</p>\n<p>And of course only elements affected by the mouse clicking - or other mouse input events - are processed in the first place. You can’t <code>Pass</code> event forward to something that wouldn’t receive an event to begin with!</p>\n<h1 id=\"using-pass-an-example\">Using Pass, an example</h1>\n<p>Let’s assume a situation where we have a button that we want to press, and we also want to detect when the mouse enters and leaves the window - we use the <code>MouseEntered</code> and <code>MouseExited</code> events set up for that and the detection element covers the whole screen. OK, so.</p>\n<p>This doesn’t work:</p>\n<pre><code>- SceneRoot (Control)\n    - Button (Texturebutton)\n    - MouseDetectionElement (Control)\n</code></pre>\n<p>Why? </p>\n<p>Because in this case <code>MouseDetectionElement</code> will block clicks to <code>Button</code> if it has its <code>MouseFilter</code> set to <code>Stop</code> and <code>Pass</code>.  And if it’s set to <code>Ignore</code> then it’s just inactive and doesn’t perform the function we would like it to do.</p>\n<p>This won’t improve the situation:</p>\n<pre><code>- SceneRoot (Control)\n     - MouseDetectionElement (Control)\n    - Button (Texturebutton)\n</code></pre>\n<p>Now we can click the <code>Button</code>, but <code>MouseDetectionElement</code> will generate erroneous mouse entered and mouse exited events whether it’s set to <code>Pass</code> or <code>Stop</code> because when the mouse moves over the <code>Button</code>, it is counted as exiting/entering the <code>MouseDetectionElement</code>. It’s not what we want here.</p>\n<p>The correct solution is to make the <code>MouseDetectionElement</code> part of the hierarchy so that the <code>Button</code> can <code>Pass</code> the events forward to its parent, the <code>MouseDetectionElement</code>:</p>\n<pre><code>- SceneRoot (Control)\n     - MouseDetectionElement (Control)\n        - Button (Texturebutton)\n</code></pre>\n<p>Here <code>Button</code> is processed first and with its <strong>Mouse Filter</strong> is set to <code>Pass</code> it will both:</p>\n<ol>\n<li>Process the mouse events </li>\n<li>and pass them along to its parent, the <code>MouseDetectionElement</code>.</li>\n</ol>\n<p>The <code>MouseDetectionElement</code> can then on its turn handle all the events correctly.</p>\n",
            "image": "https://pilvimaa.fi/media/posts/16/GodotMouseInput.jpeg",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "MouseFilter",
                   "Mouse",
                   "InputEvent",
                   "Godot"
            ],
            "date_published": "2023-11-01T21:09:44+02:00",
            "date_modified": "2023-11-01T21:12:20+02:00"
        },
        {
            "id": "https://pilvimaa.fi/gdscript-vs-c-in-godot-which-language-should-you-use/",
            "url": "https://pilvimaa.fi/gdscript-vs-c-in-godot-which-language-should-you-use/",
            "title": "GDScript vs. C# in Godot: Which language should you use?",
            "summary": "Godot is a powerful and versatile game engine that supports two scripting languages: GDScript and C#. Both languages have their own advantages and disadvantages, so it’s important to choose the&hellip;",
            "content_html": "<p>Godot is a powerful and versatile game engine that supports two scripting languages: GDScript and C#. Both languages have their own advantages and disadvantages, so it’s important to choose the one that’s right for you.</p>\n<h1 id=\"official-support\">Official support</h1>\n<p>Both GDScript and C# are officially supported by the Godot team. This means that both languages have equal access to the Godot API and documentation.</p>\n<h1 id=\"popularity\">Popularity</h1>\n<p>GDScript is by far the more popular language in Godot. It’s supported by a large community of developers. C#, on the other hand, is a newer addition to Godot, but it’s quickly gaining popularity, especially among developers who are already familiar with the language.</p>\n<h1 id=\"tutorials-and-resources\">Tutorials and resources</h1>\n<p>There are more tutorials and resources available for GDScript than for C#. This is because GDScript has been around for longer, and it’s the default language for Godot. However, the C# community is growing rapidly, and more tutorials and resources are becoming available all the time.</p>\n<h1 id=\"your-existing-skills-matter\">Your existing skills matter</h1>\n<p>Your existing skill set and personal preferences are the most important factors to consider when choosing between GDScript and C#. </p>\n<p>If you’re already familiar with C#, or if you have experience with other statically typed languages, then C# will be a more natural choice for you. You’ll be able to get started quickly, and you’ll be able to leverage your existing knowledge and skills.</p>\n<p>On the other hand, if you’re new to programming, or if you have experience with dynamically typed languages like Python, then GDScript may be a better choice for you. GDScript is easier to learn, and it has a more forgiving syntax.</p>\n<h1 id=\"ease-of-prototyping\">Ease of prototyping</h1>\n<p>GDScript is generally considered to be easier to prototype with than C#. This is because GDScript has a more relaxed syntax, and it doesn’t require as much boilerplate code. C#, on the other hand, is a more statically typed language, which can make it more difficult to prototype quickly.</p>\n<h1 id=\"applicability-beyond-godot\">Applicability beyond Godot</h1>\n<p>C# is a more widely applicable language than GDScript. C# is the primary language used in the Unity game engine, and it’s also used in a variety of other game development tools and libraries. GDScript, on the other hand, is specific to the Godot game engine.</p>\n<h1 id=\"syntax-and-style\">Syntax and style</h1>\n<p>GDScript is a Python-like language, with a simple and easy-to-read syntax. C#, on the other hand, is a more verbose language with a more traditional C-style syntax.</p>\n<h1 id=\"type-safety\">Type safety</h1>\n<p>GDScript has a level of optional type safety. This means that you can choose to use type hints to make your code more type-safe, but it’s not required. C#, on the other hand, is a statically typed language, which means that all variables and expressions must have explicitly defined types.</p>\n<h1 id=\"static-vs-dynamic-typing\">Static vs. dynamic typing</h1>\n<p>Static typing can help to prevent errors and make your code more maintainable. However, it can also make your code more verbose and difficult to prototype with. Dynamic typing, on the other hand, can make your code more concise and easier to prototype with, but it can also lead to more errors.</p>\n<h1 id=\"ides\">IDEs</h1>\n<p>C# has several professional IDEs available, such as Rider, Visual Studio and Visual Studio Code. GDScript, on the other hand, doesn’t have any dedicated IDEs. However, GDScript can be used with any text editor, and there are several plugins available that provide IDE-like features, such as syntax highlighting, code completion, and debugging.</p>\n<h1 id=\"ecosystem\">Ecosystem</h1>\n<p>The .NET ecosystem is massive in comparison to the GDScript ecosystem. This means that there are a lot more libraries and tools available for C# developers.</p>\n<h1 id=\"debugging\">Debugging</h1>\n<p>It’s generally easier to get hard to fix runtime bugs in GDScript than in C#. This is because GDScript is dynamically typed, so you can inspect and modify variables at runtime. C#, on the other hand, is statically typed, so it can be more difficult to debug runtime errors.</p>\n<h1 id=\"using-both-gdscript-and-csharp\">Using both GDScript and Csharp</h1>\n<p>It is possible to use both C# and GDScript in the same Godot project (but definitely not required). This can be useful for a variety of reasons, such as:</p>\n<p>You could leverage the strengths of both languages. For example, you could use C# (or even C++) for performance-critical code, and GDScript for prototyping and scripting simple game mechanics.</p>\n<p>However, there are also some potential drawbacks to using both C# and GDScript in the same project:</p>\n<p>It can be more difficult to maintain a project that uses multiple languages. This is because you need to be aware of the differences between the two languages, and you need to make sure that your code is compatible with both languages.</p>\n<p>It can be more difficult to debug a project that uses multiple languages. This is because you need to be able to debug code written in both languages.</p>\n<h2 id=\"language-interoperability\">Language interoperability</h2>\n<p>C# code within a Godot project can be difficult to remove once it is introduced. This is because GDscript calling into C# is good, idiomatic GDscript. However, C# calling into GDscript is bad C#, as it requires referencing functions by string. This can make your code more difficult to maintain and debug.</p>\n<p>In other words, once you start using C# code in your Godot project, it can be difficult to go back. This is because GDscript is designed to make it easy to call C# code, but C# is not designed to make it easy to call GDscript code.</p>\n<p>If you are considering using multiple languages in your Godot project, I recommend that you think carefully about whether or not you need to use C#. If you do need to use C#, try to limit the amount of code that you call.</p>\n<h1 id=\"performance\">Performance</h1>\n<p>A lot of new developers coming to Godot often worry about performance, so let’s talk about that for a bit.</p>\n<h2 id=\"gdscript-vs-csharp-speed\">GDScript vs. Csharp speed</h2>\n<p>C# is generally faster than GDScript, but this is not true in all circumstances and all situations.</p>\n<p>Marshalling can add overhead to C# code, especially when calling native Godot functions.</p>\n<p>Marshalling is the process of converting data between different programming languages. Godot is written in C++. When you call a native Godot function from C#, the .NET runtime needs to marshal the data between the two languages. This can add overhead to your code, especially if you’re calling native functions frequently.</p>\n<p>GDScript, on the other hand, doesn’t need to marshal data when calling native Godot functions. This is because GDScript is built on top of the Godot engine, and it has direct access to the Godot API.</p>\n<p>As a result, GDScript code can sometimes be faster than C# code, especially when calling native Godot functions frequently.</p>\n<h2 id=\"does-it-really-matter\">Does it really matter</h2>\n<p>If you’re developing a performance-critical game, then C# may be a better choice. </p>\n<p>But for most games, the difference in performance between GDScript and C# will be negligible.</p>\n<p>You can always write performance critical parts of your game in C++ if you find it necessary. It’s always an option whether you choose GDScript or C#.</p>\n<p>About  marshalling specifically, you can avoid any major problems simply by being mindful of the fact that marshalling happens and avoiding excessive and unnecessary back and forth between C# and Godot.</p>\n<p>Marshalling overhead is typically only significant in performance-critical applications, and you’re likely to hit other more critical bottle necks way before that happens. </p>\n<p>Know the scale of your game, know your skillset, know your personal preferences. There are a lot of things to consider when choosing a language and performance is only one of those.</p>\n<h1 id=\"final-words\">Final words</h1>\n<p>If you’re new to game development, or if you’re looking for a language that is easy to prototype with, or you’re already familiar with Python then GDScript is a good choice.</p>\n<p>If you’re already familiar with C#, or if you need a language with better performance or a wider ecosystem, then C# is a good choice.</p>\n<p>Ultimately it comes down to personal preference.</p>\n",
            "image": "https://pilvimaa.fi/media/posts/15/csharp_vs_gdscript_godot.png",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "gdscript",
                   "Godot",
                   "C#"
            ],
            "date_published": "2023-10-16T18:47:16+03:00",
            "date_modified": "2023-10-16T19:18:04+03:00"
        },
        {
            "id": "https://pilvimaa.fi/node2d-double-click-detection-in-godot/",
            "url": "https://pilvimaa.fi/node2d-double-click-detection-in-godot/",
            "title": "Node2D double click detection in Godot",
            "summary": "Clicks for Node2D based nodes can easily be detected by using CollisionObject2D‘s input_event signal. To capture the mouse clicks we can add an Area2D node and a CollisionShape2D or CollisionPolygon2D&hellip;",
            "content_html": "<p>Clicks for <code>Node2D</code>  based nodes can easily be detected by using <code>CollisionObject2D</code>‘s <code>input_event</code> signal.</p>\n<p>To capture the mouse clicks we can add an <code>Area2D</code> node and a <code>CollisionShape2D</code> or <code>CollisionPolygon2D</code> as its child node. </p>\n<p>Since we are using <code>CollisionObject2D</code>‘s <code>input_event</code> signal directly the <code>Area2D</code>‘s <code>Monitoring</code> and <code>Monitorable</code> won’t be used and we can disable those.</p>\n<p><code>Area2D</code>‘s ‘<code>Collision &gt; Layer</code> needs to be set to some value or the clicks won’t be detected.</p>\n<p>The <code>Area2D</code> node also needs to have <code>Input &gt; Pickable</code> set to <code>True</code>.</p>\n<p>Give the <code>CollisionShape2D</code> a <code>Shape</code>, eg. <code>RectangleShape2D</code>, <code>CircleShape2D</code>, <code>CapsuleShape2D</code>, etc. and set its <code>Size</code> to the dimensions you want. This defines the area’s size and shape that can be clicked with the mouse. </p>\n<p>Finally set the <code>CollisionShape2D</code>‘s <code>Transform &gt; Position</code> to the location where you want it.</p>\n<p>Now we can add a script to the <code>Area2D</code> node and in <code>Area2D</code>‘s <code>Node &gt; Signals</code> connect the <code>input_event</code> to the script.</p>\n<p>See example below.</p>\n<pre><code class=\"language-cs\">public void OnContainerBeingClicked(Node viewport, InputEvent @event, int shapeIdx) {  \n  \n    // Return if not mouse left button double click.  \n    if (@event is not InputEventMouseButton mouseButtonEvent) return;  \n    if (!mouseButtonEvent.Pressed) return;  \n    if (mouseButtonEvent.ButtonIndex != MouseButton.Left) return;  \n    if (!mouseButtonEvent.DoubleClick) return;  \n  \n    ToggleContainer();  \n}\n</code></pre>\n<p>The code is pretty self-explanatory, but let’s break it down.</p>\n<p>In the method signature we need to return <code>void</code>, and accept <code>Node</code>, <code>InputEvent</code>, and <code>int</code> as parameters - even if we don’t use them all. It’s simply required to connect the signal.</p>\n<p>Since <code>event</code> is a reserved keyword we are required to place <code>@</code> in front of it if we want to use that particular name in our parameters, ie. <code>@event</code> instead of <code>event</code>. But we might as well use any other name such as <code>inputEvent</code> if it strikes your fancy - it really doesn’t matter. The parameter names can be what ever you want as long as the types match <code>Node</code>, <code>InputEvent</code> and <code>int</code>. The signal will still work.</p>\n<p>We cannot directly handle <code>InputEventMouseButton</code>, so we need to use <code>InputEvent</code>  instead and cast it to <code>InputEventMouseButton</code>:</p>\n<pre><code class=\"language-cs\">if (@event is not InputEventMouseButton mouseButtonEvent) return;  \n</code></pre>\n<p>Here we check whether <code>@event</code> is or isn’t <code>InputEventMouseButton</code>. If it’s not we simply return and do nothing further with that particular input event - someone else can handle that one, what ever it is.</p>\n<p>If the <code>@event</code> is <code>InputEventMouseButton</code> we cast it as <code>InputEventMouseButton</code> and expose the cast as a local variable called <code>mouseButtonEvent</code> and continue executing our code. We can now access the <code>InputEventMouseButton</code> mouse button event via <code>mouseButtonEvent</code> and do further things.</p>\n<pre><code class=\"language-cs\">if (!mouseButtonEvent.Pressed) return;\n</code></pre>\n<p>Here we immediately put it to use and check if the mouse button is not being pressed (ie. it’s likely being released instead), we will simply return and call it quits there - it’s not our concern.</p>\n<pre><code class=\"language-cs\">if (mouseButtonEvent.ButtonIndex != MouseButton.Left) return;\n</code></pre>\n<p>We still don’t know what kind of mouse button press this was, so we can check by using the <code>ButtonIndex</code> whether it was something else than a <strong>left</strong> mouse button press - in which case we simply return and call it quits again. It’s not our concern, since in this example we want to handle left mouse buttons clicks only.</p>\n<pre><code class=\"language-csharp\">if (!mouseButtonEvent.DoubleClick) return;\n</code></pre>\n<p>Finally we have a very handy way of checking whether a double click happened without having to deal with timers and special logic each time - we can simply check the <code>DoubleClick</code> property. Godot will expose to us automatically the information whether it was a double click or not. If it’s not a double click, again, we return and call it quits there.</p>\n<p>Now we’ve determined:</p>\n<ol>\n<li>It is a mouse button event.</li>\n<li>It is a mouse button being pressed down event.</li>\n<li>It is a left mouse button event.</li>\n<li>It is a double click</li>\n</ol>\n<p>So we know the user did a left mouse button double click, so we can now do what ever we want with that information.</p>\n<pre><code class=\"language-csharp\">ToggleContainer();\n</code></pre>\n<p>In the above example what we do is we call our own custom <code>ToggleContainer()</code> method which opens - or closes - an inventory container window for us.</p>\n<p>But you can call your own methods or do what ever you want once you’ve ruled out all the cases you don’t want to react to like we did above one step at a time.</p>\n<p>You can also combine the if-statements if you like. We have kept them separate in the example for additional clarity and readability.</p>\n<p>But you might also do this:</p>\n<pre><code class=\"language-csharp\">if (@event is not InputEventMouseButton mouseButtonEvent  \n    || !mouseButtonEvent.Pressed  \n    || mouseButtonEvent.ButtonIndex != MouseButton.Left  \n    || !mouseButtonEvent.DoubleClick) {  \n    return;  \n}\n</code></pre>\n<p>The IL code produced by either of these examples is slightly different, but not meaningfully so.</p>\n<p>It’s also worth noting that when using <code>return</code>s, like in the first example, the stack traces can be more meaningful when tracking down problems.</p>\n<p>But generally the second example would execute faster. But this would be in the realm of nano optimizations and might be made a moot point anyway by future updates to the runtime.</p>\n<p>It’s also worth noting that in Godot 4 you can implicitly cast the <code>Node</code> by accepting <code>Viewport</code> instead of <code>Node</code> in the signal’s method signature as a parameter - and it will still work because <code>Viewport</code> is a child of <code>Node</code>.</p>\n<p>So if you want to handle the input, for example, so it doesn’t propagate any further - and you don’t want to cast the <code>Node</code> in your code explicitly to <code>Viewport</code> which you need to access the <code>SetInputAsHandled()</code> method, you can accept a <code>Viewport</code> directly instead of <code>Node</code> which is declared in the <code>input_event</code> signal’s signature.</p>\n<p>Eg.</p>\n<pre><code class=\"language-csharp\">public void OnContainerBeingClicked(Viewport viewport, InputEvent @event, int shapeIdx) {  \n  \n    // Return if not mouse left button double click.  \n    if (@event is not InputEventMouseButton mouseButtonEvent) return;  \n    if (!mouseButtonEvent.Pressed) return;  \n    if (mouseButtonEvent.ButtonIndex != MouseButton.Left) return;  \n    if (!mouseButtonEvent.DoubleClick) return;  \n      \n    viewport.SetInputAsHandled();  \n    ToggleContainer();  \n}\n</code></pre>\n<p>This will also work. Otherwise we would have to:</p>\n<pre><code class=\"language-csharp\">public void OnContainerBeingClicked(Node viewport, InputEvent @event, int shapeIdx) {  \n  \n    // Return if not mouse left button double click.  \n    if (@event is not InputEventMouseButton mouseButtonEvent) return;  \n    if (!mouseButtonEvent.Pressed) return;  \n    if (mouseButtonEvent.ButtonIndex != MouseButton.Left) return;  \n    if (!mouseButtonEvent.DoubleClick) return;  \n      \n    ((Viewport)viewport).SetInputAsHandled();  \n    ToggleContainer();  \n}\n</code></pre>\n<p>That’s mostly it for handling mouse double clicks in Node2D nodes.</p>\n",
            "image": "https://pilvimaa.fi/media/posts/14/computer_mice_double_click.png",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "InputEvent",
                   "Input",
                   "Godot",
                   "Csharp",
                   "C#"
            ],
            "date_published": "2023-06-14T02:08:31+03:00",
            "date_modified": "2023-06-14T02:08:31+03:00"
        },
        {
            "id": "https://pilvimaa.fi/implicit-and-explicit-conversion-operators/",
            "url": "https://pilvimaa.fi/implicit-and-explicit-conversion-operators/",
            "title": "Implicit and explicit conversion operators",
            "summary": "Implicit and explicit conversion operators allow you to ingegrate your custom types seamlessly with other types by doing implicit or explicit conversions from one type to another. public void SetPositionFromVector3(Vector3&hellip;",
            "content_html": "<p>Implicit and explicit conversion operators allow you to ingegrate your custom types seamlessly with other types by doing implicit or explicit conversions from one type to another.</p>\n<pre><code class=\"language-cs\">    public void SetPositionFromVector3(Vector3 vector) {\n        // Do stuff.\n    }\n\n    MyType myType = new MyType(0,0,0);\n    SetPositionFromVector3(myType); // Argument type &#39;MyType&#39; is not assignable to parameter type &#39;Vector3&#39;\n</code></pre>\n<p>If you’ve ever experienced one of those situations where you have your awesome custom type <code>MyType</code> which is essentially a <code>Vector3</code>, or what ever, with some extra spices that you really need … but now you can’t pass it to anything that really wants a <code>Vector3</code>. And you end up doing all kinds of weird things like exposing a special property or using inheritance and polymorphism to get it working… </p>\n<p>Do not fret! We’ll have none of those shenanigans. <code>implicit</code> and <code>explicit</code> conversion operators to the rescue!</p>\n<p>Let’s look at a simplification of how <code>implicit</code> operator is used.</p>\n<pre><code class=\"language-cs\">class MyType {\n    private Vector3 _myValue;\n    public float x =&gt; _myValue.x;\n    public float y =&gt; _myValue.x;\n    public float z =&gt; _myValue.x;\n    public static implicit operator Vector3(MyType myType) =&gt; _myvalue;\n    //  ^    ^       ^        ^       ^        ^-- Input type    ^-- Return value\n    //  |    |       |        |       `-- Output type\n    //  `----`-------`--------`-- Magical keywords\n}\n</code></pre>\n<p>That’s how you get it working. But lets examine this declaration word by word and break it apart.</p>\n<p>All the operators have to be declared <code>public</code> and they also have to be <code>static</code>.  Next we declare the <code>implicit</code> or <code>explicit</code> keyword. What <code>implicit</code> means is basically “Don’t ask stupid questions, just do the conversion for me - <em>implicitly</em>, automatically, ie. it is <em>implied</em>.” (The <code>explicit</code> keyword will be explained further down below). Next up we have to use the <code>operator</code> keyword which allows overloading existing C# operators. Then we have <code>Vector3</code> as the type which we overload, ie. essentially our “return type” if you allow such a simplification. In the parameters we have the type we are converting from. In our function body we define how the correct value gets returned. In this example we simply return the value from the private field <code>_myValue</code>.</p>\n<p>The <code>explicit</code> keyword works in pretty much the same way as the <code>implicit</code> keyword, except you have to do the casting yourself, <em>explicitly</em>, when you use it, eg.</p>\n<pre><code class=\"language-cs\">    MyType myType = new MyType(0,0,0);\n    SetPositionFromVector3((Vector3) myType); // explicit casting is required with explicit keyword.\n</code></pre>\n<p>Instead of implicitly as shown below.</p>\n<pre><code class=\"language-cs\">    MyType myType = new MyType(0,0,0);\n    SetPositionFromVector3(myType); // with implicit keyword casting is done automatically.\n</code></pre>\n<p>NOTE: If you decide to use the <code>implicit</code> keyword, you have to be careful because it will be less obvious what is going on in the code.</p>\n<p>To do the conversion the other way around, ie. in our example from <code>Vector3</code> to <code>MyType</code>, we can simply switch the places of the types and make sure somehow that the correct type and values are returned.</p>\n<pre><code class=\"language-cs\">class MyType {\n    private Vector3 _myValue;\n    // This is what we did before.\n    public static implicit operator Vector3(MyType myType) =&gt; _myvalue;\n    // Here we switched things around.\n    public static implicit operator MyType(Vector3 myType) =&gt; new Vector3(myType.x, myType.z, myType.z);\n}\n</code></pre>\n",
            "image": "https://pilvimaa.fi/media/posts/13/Spaghetti.jpg",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "Implicit",
                   "Explicit",
                   "Conversion",
                   "C#"
            ],
            "date_published": "2022-07-29T16:15:52+03:00",
            "date_modified": "2022-07-30T10:25:33+03:00"
        },
        {
            "id": "https://pilvimaa.fi/unit-testing-private-methods-through-extraction/",
            "url": "https://pilvimaa.fi/unit-testing-private-methods-through-extraction/",
            "title": "Unit testing private methods through extraction",
            "summary": "When you use unit tests you have to intentionally write code that is testable. What about private methods? How do you test those? And no, you should NOT change the&hellip;",
            "content_html": "<p>When you use unit tests you have to <em><strong>intentionally</strong></em> write code that is testable.</p>\n<p>What about <code>private</code> methods? How do you test those?</p>\n<p>And no, you <em><strong>should NOT</strong></em> change the accessibility of your methods (eg. <code>internal</code>, <code>public</code>, etc.) to make your code testable as you would lose your code’s correctness - there’s a reason why those <code>private</code> methods have been made <code>private</code>!</p>\n<p>There are several ways to approach this problem. For example you could use the <code>PrivateObject</code> class. Or you could use <strong>reflection</strong>. </p>\n<p>In this article, however, we are going to take a look at using <strong>extraction</strong> and good coding practices to make our <code>private</code> methods more accessible while also retaining our code’s correctness.</p>\n<p>Let’s assume a situation where</p>\n<pre><code class=\"language-cs\">public class Player {\n    \n    private void Attack() {\n        System.Console.WriteLine(&quot;Enemy takes damage!&quot;);\n    }\n    \n    private void Move() {\n        System.Console.WriteLine(&quot;You moved!&quot;);\n    }\n    \n    public override void _PhysicsProcess(float delta) {\n        Attack();\n        Move();\n    }\n    \n}\n</code></pre>\n<p>You can’t test the above methods, <code>Attack()</code> and <code>Move()</code>, because they are <code>private</code> and not exposed to the outside world. But you also want to keep it that way, it’s an important requirement.</p>\n<p>Making the methods <code>public</code> would be bad. Using reflection to test the methods would work, but it’s not fun nor a good approach in general.</p>\n<p>Let’s use <strong>method extraction</strong> instead and turn those methods into <strong>abstractions</strong>.</p>\n<pre><code class=\"language-cs\">public class RefactoredPlayer {\n    private Attacker attacker;\n    private Mover mover;\n\n    public override void _PhysicsProcess(float delta) {\n        attacker.Attack();\n        mover.Move();\n    }\n}\n</code></pre>\n<p>What we’ve done here is we’ve refactored the <code>Player</code> class and extracted the <code>Attack()</code> and <code>Move()</code> methods into their own classes, <code>Attacker</code> and <code>Mover</code>. Now the <code>RefactoredPlayer</code> describes only the <em>flow of the code</em> and not it’s <em>implementation</em>, thus allowing us to keep the composed <code>attacker</code> and <code>mover</code> objects in the <code>RefactoredPlayer</code> class <code>private</code> while exposing the abstractions as <code>public</code> (see below).</p>\n<pre><code class=\"language-cs\">public abstract class Attacker {\n    public abstract void Attack();\n}\n\npublic abstract class Mover {\n    public abstract void Move();\n}\n</code></pre>\n<p><strong>IMPORTANT:</strong> We don’t have to test the <code>RefactoredPlayer</code> class anymore, we can now test the <em><strong>actual implementations</strong></em> of <code>Attacker</code> and <code>Mover</code> or the <em><strong>abstract classes</strong></em> themselves (for that you need to make an anonymous class implementation of your abstract class as you can’t instantiate an abstract class). Which one you want to do depends mostly on whether your actual implementations have extra features beyond the promises made in the <code>abstract</code> classes or not.</p>\n<p>As a bonus you can now have several implementations of <code>Attacker</code> and <code>Mover</code> and depend upon <strong>abstractions</strong> instead of concrete implementations giving your <code>RefactoredPlayer</code> class less reasons to change and your code becomes more flexible.</p>\n<pre><code class=\"language-cs\">public class SwordAttack : Attacker {\n    public override void Attack() {\n        System.Console.WriteLine(&quot;You skewer the enemy with your sword!&quot;);\n    }\n}\n</code></pre>\n<p>Here we have an example of an actual implementation of one of our abstract classes. We would still want to depend upon the abstraction <code>Attacker</code> rather than the implementation <code>SwordAttack</code> - to make our code more fluid and easier to change. This way we don’t have to change our <code>RefactoredPlayer</code> class if our implementation changes or gets swapped out to something else that is also implementing the <code>abstract</code> class <code>Attacker</code>.</p>\n",
            "image": "https://pilvimaa.fi/media/posts/12/Bugs.jpg",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "Unit Testing",
                   "C#"
            ],
            "date_published": "2022-07-24T14:32:10+03:00",
            "date_modified": "2022-07-24T14:43:32+03:00"
        },
        {
            "id": "https://pilvimaa.fi/getting-godotxunit-up-and-running-with-rider/",
            "url": "https://pilvimaa.fi/getting-godotxunit-up-and-running-with-rider/",
            "title": "Getting GodotXUnit up and Running with Rider",
            "summary": "Installation from Github These instructions will explain how to get GodotXUnit integrated to your project and working with Rider. [XunitTestCaseDiscoverer(&quot;GodotXUnitApi.Internal.GodotFactDiscoverer&quot;, &quot;GodotXUnitApi&quot;)] And replace the GodotXUnitApi with your project’s assembly name,&hellip;",
            "content_html": "<h2 id=\"installation-from-github\">Installation from Github</h2>\n<p>These instructions will explain how to get GodotXUnit integrated to your project and working with Rider.</p>\n<ol>\n<li>Clone the <code>Master</code> branch of the GodotXUnit project in some temporary folder:\n<code>git clone https://github.com/fledware/GodotXUnit.git</code></li>\n<li>From the freshly cloned project, copy the contents of the <code>addons</code> folder into your project’s <code>addons</code> folder - or if that doesn’t exist yet then simply copy the whole <code>addons</code> folder itself to your Godot project’s root. After doing this you  can delete the rest of the files from the cloned project, you don’t need them.</li>\n<li>Delete any <code>.csproj</code> files you can find under <code>addons/GodotXUnit</code> and its sub-folders. At the time of writing this there should be only one <code>.csproj</code> located at <code>addons/GodotXUnit/GodotXUnitApi/GodotXUnitApi.csproj</code>. Delete it. With this installation method the GodotXUnit will become a part of your own project, so there’s no need to have any other <code>.csproj</code> files lying around.</li>\n<li>In the file <code>addons/GodotXUnit/GodotXUnitApi/GodotFactAttribute.cs</code> find a line that says:</li>\n</ol>\n<pre><code class=\"language-xml\">[XunitTestCaseDiscoverer(&quot;GodotXUnitApi.Internal.GodotFactDiscoverer&quot;, &quot;GodotXUnitApi&quot;)]\n</code></pre>\n<p>And replace the <code>GodotXUnitApi</code> with your project’s assembly name, eg.</p>\n<pre><code class=\"language-xml\">[XunitTestCaseDiscoverer(&quot;GodotXUnitApi.Internal.GodotFactDiscoverer&quot;, &quot;MyAwesomeGodotProject&quot;)]\n</code></pre>\n<p>You have to do this because GodotXUnit will scan your project for test cases and it needs to know the assembly to scan. If you <em><strong>don’t</strong></em> do this GodotXUnit will not find your test cases. </p>\n<ol start=\"6\">\n<li>Add these dependencies to your project’s <code>.csproj</code></li>\n</ol>\n<pre><code class=\"language-xml\">&lt;ItemGroup&gt;\n    &lt;PackageReference Include=&quot;Newtonsoft.Json&quot; Version=&quot;12.0.3&quot; /&gt;\n    &lt;PackageReference Include=&quot;xunit&quot; Version=&quot;2.4.1&quot; /&gt;\n    &lt;PackageReference Include=&quot;xunit.runner.utility&quot; Version=&quot;2.4.1&quot; /&gt;\n&lt;/ItemGroup&gt;\n</code></pre>\n<p>Now you should be good to go.</p>\n<h2 id=\"running-the-tests\">Running the tests</h2>\n<p>Annotate your tests with <code>[GodotFact]</code> and they should work directly from Rider.</p>\n<p>If you want to write anything that uses the <strong>Godot Engine</strong>, make sure you make a <strong>base class</strong> for these tests and annotate it with a <strong>Collection attribute</strong>, as shown in the example below.</p>\n<pre><code class=\"language-cs\">// super important - this prevents the tests from running in parallel.\n// if they would run in parallel, they would interfere with each other.\n[Collection(&quot;Integration Tests&quot;)] public abstract class BaseTest : IAsyncLifetime\n</code></pre>\n<p>And when <strong>waiting</strong> for things:</p>\n<pre><code class=\"language-cs\">\n// Then within 5 seconds the player should be dead because\n// the monster will attack the player.\n    await GetTree().WithinSeconds(5, () =&gt; {\n        // This assertion will be repeatedly run every frame\n        // until it either succeeds or the 5 seconds have elapsed.\n        Assert.True(arena.Player.IsDead);\n    });\n</code></pre>\n<p>Generally you can follow any instructions you can find for <strong>XUnit</strong>. The only real difference aside from the cases above is that you use <code>[GodotFact]</code> instead of <code>[Fact]</code>.</p>\n<h2 id=\"more-information\">More information</h2>\n<p>Check out the GodotXUnit Github page: \n<a href=\"https://github.com/fledware/GodotXUnit\">https://github.com/fledware/GodotXUnit</a></p>\n",
            "image": "https://pilvimaa.fi/media/posts/11/Test.jpg",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "XUnit",
                   "Unit Testing",
                   "GodotXUnit",
                   "Godot",
                   "C#"
            ],
            "date_published": "2022-07-18T17:54:14+03:00",
            "date_modified": "2022-07-18T17:54:14+03:00"
        },
        {
            "id": "https://pilvimaa.fi/axis-aligned-bounding-boxes-and-intersections/",
            "url": "https://pilvimaa.fi/axis-aligned-bounding-boxes-and-intersections/",
            "title": "Axis Aligned Bounding Boxes and Intersections",
            "summary": "Let’s do a quick overview of AABBs and intersections. Axis Aligned Bounding Box is a set of three segments (or 6 numbers). AABBs can be used for fast overlapping tests.",
            "content_html": "<p>Let’s do a quick overview of AABBs and intersections.</p>\n<p>Axis Aligned Bounding Box is a set of three segments (or 6 numbers). AABBs can be used for fast overlapping tests.</p>\n<p>In one dimension it is a <code>Segment</code> or <code>AxisAlignedBounds1D</code>:</p>\n<pre><code class=\"language-cs\">struct Segment {\n    public float min;\n    public float max;\n}\n</code></pre>\n<p>Let’s calculate an intersection for two segments.</p>\n<pre><code class=\"language-cs\">Segment Intersect(Segment a, Segment b) =&gt;\n    new Segment {\n        Min = Math.Max(a.Min, b.Min),\n        Max = Math.Min(a.Max, b.Max)\n    };\n</code></pre>\n<p>In two dimensions it is a <code>Rectangle</code> or <code>AxisAlignedBounds2D</code>:</p>\n<pre><code class=\"language-cs\">struct Rectangle {\n    Segment boundsX;\n    Segment boundsY;\n}\n</code></pre>\n<p>Let’s calculate an intersection for two rectangles.</p>\n<pre><code class=\"language-cs\">Rectangle Intersect(Rectangle a, Rectangle b) =&gt;\n    new Rectangle {\n        X = Segment.Intersect(a.X, b.X),\n        Y = Segment.Intersect(a.Y, b.Y)\n    };\n</code></pre>\n<p>In three dimensions it is <code>AABB</code> (Axis Aligned Bounding Box) or <code>AxisAlignedBounds3D</code>:</p>\n<pre><code class=\"language-cs\">struct AABB {\n    public Segment boundsX;\n    public Segment boundsY;\n    public Segment boundsZ;\n}\n</code></pre>\n<p>Let’s calculate an intersection for two AABBs.</p>\n<pre><code class=\"language-cs\">AABB Intersect(AABB a, AABB b) =&gt;\n    new AABB {\n        X = Segment.Intersect(a.X, b.X),\n        Y = Segment.Intersect(a.Y, b.Y),\n        Z = Segment.Intersect(a.Z, b.Z),\n    };\n</code></pre>\n<p>Let’s do it slightly differently for fun.</p>\n<p>Testing intersection via bounds in 1D:</p>\n<pre><code class=\"language-cs\">struct Bounds{\n    public float Min;\n    public float Max;\n    \n    public Bounds Intersection(Bounds other) =&gt;\n        new Bounds {\n            Min = Math.Max(this.Min, other.Min),\n            Max = Math.Min(this.Max, other.Max)\n        };\n        \n    public bool Intersects(Bounds other) {\n        var i = this.Intersection(other);\n        return i.Min &lt; i.Max;\n    }\n}\n</code></pre>\n<p>Testing intersections via bounds in 2D:</p>\n<pre><code class=\"language-cs\">struct Bounds2D {\n    public Bounds BoundsX;\n    public Bounds BoundsY;\n    public Bounds2D Intersection(Bounds2D other) =&gt;\n        new Bounds2D {\n            BoundsX = this.XBounds.Intersection(other.BoundsX),\n            BoundsY = this.YBounds.Intersection(other.BoundsY);\n        };\n    public bool IsValid =&gt; BoundsX.IsValid &amp;&amp; BoundsY.IsValid;\n    public bool Intersects(Bounds2D other) =&gt;\n        this.Intersection(other).IsValid;\n}\n</code></pre>\n<p>Testing intersections via bounds in 3D:</p>\n<pre><code class=\"language-cs\">struct Bounds3D {\n    public Bounds BoundsX;\n    public Bounds BoundsY;\n    public Bounds BoundsZ;\n    public Bounds3D Intersection(Bounds3D other) =&gt;\n        new Bounds3D {\n            BoundsX = this.BoundsX.Intersection(other.BoundsX),\n            BoundsY = this.BoundsY.Intersection(other.BoundsY);\n            BoundsZ = this.BoundsZ.Intersection(other.BoundsZ);\n        };\n    public bool IsValid =&gt; BoundsX.IsValid &amp;&amp; BoundsY.IsValid &amp;&amp; BoundsZ.IsValid;\n    public bool Intersects(Bounds3D other) =&gt;\n        this.Intersection(other).IsValid;\n}\n</code></pre>\n",
            "image": "https://pilvimaa.fi/media/posts/10/AABB.jpg",
            "author": {
                "name": "Pilvinen"
            },
            "tags": [
                   "Math",
                   "C#",
                   "AABB"
            ],
            "date_published": "2022-07-16T01:15:43+03:00",
            "date_modified": "2022-07-16T01:47:10+03:00"
        }
    ]
}
